app/controllers/api/messages_controller.rb

SELECT "greetings".* FROM "greetings"
---
  def index
    messages = Greeting.all.shuffle